# 1 куча увеличение
Для игры, описанной в задании 19, найдите минимальное значение S, при котором одновременно выполняются два  
условия:  
- у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;  
- у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
```python
def F(s, x):
    if s >= 125 or x < 0: return x % 2 == 0
    moves = [F(s + 2, x - 1), F(s + 4, x - 1), F(s * 2, x - 1)]

    # для нас any, для противника all
    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)

for s in range(1, 125):
    # x - количество ходов за игру
    if F(s, 4) and not F(s, 2):
        print(s)
```
# 1 куча уменьшение
```python
def F(s, x):
    if s <= 30 or x < 0: return x % 2 == 0
    moves = [F(s - 3, x - 1), F(s - 5, x - 1), F(s // 4, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)
    
for s in range(31, 200):
    if F(s, 4) and not F(s, 2):
        print(s)
```
# 2 кучи увеличение
Для игры, описанной в задании 19, найдите минимальное значение S, при котором одновременно выполняются два условия:  
- у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;  
- у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
```python
def F(s1, s2, x):
    if s1 + s2 >= 211 or x < 0: return x % 2 == 0
    moves = [F(s1 + 1, s2, x - 1), F(s1 * 2, s2, x - 1), F(s1, s2 + 1, x - 1), F(s1, s2 * 2, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)
    
for s in range(1, 194):
    if F(17, s, 4) and not F(17, s, 2):
        print(s)
        break
```
# 2 кучи уменьшение
Для игры, описанной в задании 19, найдите наименьшее значение S, при котором одновременно выполняются два условия:
- у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
- у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
```python
def F(s1, s2, x):
    if s1 + s2 <= 100 or x < 0: return x % 2 == 0
    moves = [F(s1 - 3, s2 - 3, x - 1), F(s1 // 2, s2, x - 1), F(s1, s2 // 2, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)
    
for s in range(53, 1000):
    if F(48, s, 4) and not F(48, s, 2):
        print(s)
```