# Теория
Маска делится на 2 части: в первой части находятся только единицы, а во второй - только нули. *Первым* адресом является адрес *сети*, следующие - адрес *узла*, а последний - *широковещательный* адрес.
Адрес сети - постоянная часть адреса, там где у маски стоят нули
Адрес узла различается, у маски там стоят нули

***ip для устройств / компьютеров не могут быть последними и первыми***
Кол-во адресов для устройств или компьютеров = кол-во адресов - 2

Адрес сети = Маска & IP адрес

Номер компьютера = IP адрес - адрес сети

```python
print(net[-2]) # наибольший адрес
print(net[1]) # наименьший адрес

net.hosts() # берёт только ip адреса компьютеров / устройств / узлов
net.num_addresses # Кол-во адресов в сети net

print(f'{ip:b}') #перевод ip в двоичную
print('.'.join(f'{x:>08b}' for x in [135,12,171,214])) # перевод ip в двоичную с разделением точками
```
# 1
По заданным ІР-адресу узла сети и маске определите адрес сети: 
ІР-адрес: 135.12.171.214 
Маска: 255.255.248.0
```python
from ipaddress import *

net = ip_network('135.12.171.214/255.255.248.0', 0)
print(net) # адрес - то, что слева от /
```
# 2
Для узла с IР-адресом 111.81.208.27 адрес сети равен 111.81.192.0. Чему равно наименьшее возможное значение третьего слева байта маски? Ответ запишите в виде десятичного числа.
```python
from ipaddress import *

for mask in range(33):
    net = ip_network(f'111.81.208.27/{mask}', 0)
    print(net, net.netmask)
# 1. ищем в выводе адрес сети, как в задании
# 2. находим напротив него маску и берём оттуда 3-й слева байт
# 3. масок несколько -> берём наименьшее значение байта
```
# 3
Два узла, находящиеся в одной сети, имеют IP-адреса 112.117.107.70 и 112.117.121.80.
Укажите наибольшее возможное значение третьего слева байта маски сети. Ответ запишите в виде десятичного числа.
```python
from ipaddress import *

for mask in range(33):
    net1 = ip_network(f'112.117.107.70/{mask}', 0)
    net2 = ip_network(f'112.117.121.80/{mask}', 0)
    # Одинаковые подсети -> знак ==
    # Разные подсети -> знак !=
    if net1 == net2:
        print(net1, net1.netmask)
```
# 4
Для некоторой подсети используется маска 255.255.254.0. Сколько различных адресов компьютеров теоретически допускает эта маска, если два адреса (адрес сети и широковещательный) не используют?
```python
from ipaddress import *

net = ip_network('0.0.0.0/255.255.254.0')
print(net.num_addresses - 2)
```
# 5
Для узла с IР-адресом 108.133.75.91 адрес сети равен 108.133.75.64. Чему равно наибольшее количество возможных адресов в этой сети?
```python
from ipaddress import *

for mask in range(33):
    net = ip_network(f'108.133.75.91/{mask}', 0)
    if '108.133.75.64' in str(net):
        print(net, net.num_addresses)
```
# 6
Для узла с IР-адресом 175.122.80.13 адрес подсети равен 175.122.80.0. Сколько существует различных возможных значений маски, если известно, что в этой сети не менее 60 узлов? Ответ запишите в виде десятичного числа.
```python
from ipaddress import *

for mask in range(33):
    net = ip_network(f'175.122.80.13/{mask}', 0)
    if '175.122.80.0' in str(net) and net.num_addresses >= 60:
        print(net, net.num_addresses)
```
# 7
Сеть задана ІР-адресом 184.178.54.144 и маской сети 255.255.255.240. Сколько в этой сети ІР-адресов, у которых в двоичной записи ІР-адреса имеется сочетание трех подряд идущих единиц?
```python
from ipaddress import *

net = ip_network('184.178.54.144/255.255.255.240', 0)

cnt = 0
for ip in net:
    if '111' in bin(int(ip))[2:].zfill(32):
        cnt += 1
print(cnt)
```
# 8
Если маска подсети 255.255.255.240 и IP-адрес компьютера в сети 192.168.156.235, тο
чему будет равен номер компьютера в сети?
```python
from ipaddress import *

net = ip_network('192.168.156.235/255.255.255.240', 0)
print(net) # 192.168.156.224/28

ip1 = ip_address('192.168.156.235')
ip2 = ip_address('192.168.156.224')
print(int(ip1) - int(ip2))
```
# 9
Некоторая сеть имеет маску 255.255.128.0. Сколько в этой сети ІР-адресов, для которых числовое значение четырёхбайтного ІР-адреса кратно четырём?
```python
from ipaddress import *

net = ip_network('0.0.0.0/255.255.128.0', 0)

cnt = 0
for ip in net:
    if int(ip) % 4 == 0:
        cnt += 1
print(cnt)
```
# 10
Для узла с ІР-адресом 238.237.149.255 адрес сети равен 238.237.148.0. Каково наибольшее
возможное количество единиц в двоичной записи маски?
```python
from ipaddress import *
# адрес узла
usel = ip_address('238.237.149.255')

for mask in range(31):
    net = ip_network(f'238.237.149.255/{mask}', 0)
    # Проверяем, что узел не является адресом сети или широковещательным
    if '148.0' in str(net) and net[0] < usel < net[-1]:
        print(net, net.broadcast_address)
```
# 11
Два узла, находящиеся в разных подсетях, имеют IP-адреса 118.187.59.255 и 118.187.65.115. В масках обеих подсетей одинаковое количество единиц. Укажите наибольшее возможное количество единиц в масках этих подсетей. Учтите, что два адреса в любой подсети зарезервированы: адрес всей подсети и широковещательный адрес.
```python
from ipaddress import *

ip1 = ip_address('118.187.59.255')
ip2 = ip_address('118.187.65.115')

for mask in range(31):
    net1 = ip_network(f'{ip1}/{mask}', 0)
    net2 = ip_network(f'{ip2}/{mask}', 0)
    # Узлы находятся в разных подсетях и не являются адресами сети и широковещательными
    if net1 != net2 and net1[0] < ip1 < net1[-1] and net2[0] < ip2 < net2[-1]:
        print(mask)
```
# 12
Сеть, в которой содержится узел с IP-адресом 207.0.А.167, задана маской сети 255.255.255.192, где А-некоторое допустимое для записи IP-адреса число. Определите количество значений А, для которых для всех ІР-адресов этой сети в двоичной записи IP-адреса суммарное количество нулей в левых двух байтах больше суммарного количества нулей в правых двух байтах.
В ответе укажите только число.
```python
from ipaddress import *

cnt = 0
for A in range(256):
    ip = ip_address(f'207.0.{A}.167')
    net = ip_network(f'{ip}/255.255.255.192', 0)
    if all(f'{ip:b}'[:16].count('0') > f'{ip:b}'[16:].count('0') for ip in net):
        if net[0] < ip < net[-1]:
            cnt += 1
print(cnt)
```
# 13
Сеть, в которой содержится узел с IР-адресом 152.65.245.132, задана маской сети 255.255.4.0, где А-некоторое допустимое для записи маски число. Определите минимальное значение А, для которого для всех IP-адресов этой сети в двоичной записи IP-адреса суммарное количество нулей в левых двух байтах не менее суммарного количества нулей в правых двух байтах.
В ответе укажите только число.
```python
from ipaddress import *

for mask in range(16, 25):
    ip = ip_address('152.65.245.132')
    net = ip_network(f'{ip}/{mask}', 0)
    if all(f'{ip:b}'[:16].count('0') >= f'{ip:b}'[16:].count('0') for ip in net):
        print(net.netmask)
```
# 14
Сеть задана IP-адресом 192.168.160.0 и маской сети 255.255.224.0.
Сколько в этой сети IP-адресов компьютеров, в которых столько же единиц, сколько в маске?
```python
from ipaddress import *

net = ip_network('192.168.160.0/255.255.224.0', 0)

k = 0
count1InMask = (bin(255)[2:] + bin(255)[2:] + bin(224)[2:]).count('1')
for ip in net.hosts():
    ip2 = bin(int(ip))[2:].zfill(32)
    if ip2.count('1') == count1InMask:
        k += 1
print(k)
```
# 15
Для узла с ІР-адресом 117.191.138.37 адрес сети равен 117.191.136.0. Чему равно наименьшее возможное значение третьего слева байта маски?
```python
ip1 = bin(117)[2:].zfill(8) + bin(191)[2:].zfill(8) + bin(138)[2:].zfill(8) + bin(37)[2:].zfill(8)
ip2 = bin(117)[2:].zfill(8) + bin(191)[2:].zfill(8) + bin(136)[2:].zfill(8) + bin(0)[2:].zfill(8)
print(ip1, ip2)
ip = '0111 0101.1011 1111.1000 1010.0010 0101'
ms = '1111 1111.1111 1111.1111 1X00.0000 0000'
ad = '0111 0101.1011 1111.1000 1000.0000 0000'
# Берём третий байт слева
print(int('11111000', 2))
```
