0 - чётное число!

# Пример 1
Все 5-⁠буквенные слова, составленные из букв А, О, У, записаны в алфавитном порядке. Вот начало списка:
1.  ААААА
2.  ААААО
3.  ААААУ
4.  АААОА
……
Запишите слово, которое стоит на 210-⁠м месте от начала списка.
**Решение**:
Заменим буквы А, О, У на 0, 1, 2 (для них порядок очевиден по возрастанию).
Выпишем начало списка, заменив буквы на цифры.
1. 00000
2. 00001
3. 00002
4. 00010
Полученная запись есть числа, записанные в троичной системе счисления в порядке возрастания. Тогда на 210 месте будет стоять число 209 (так как первое число 0).
В троичной системе 209 запишется как 21202. Произведём обратную замену и получим УОУАУ.
Ответ: УОУАУ.
**Код:**
```python
a = {0: "А", 1: "О", 2: "У"}
k = 0
for i in range(0, len(a)):
    for j in range(0, len(a)):
        for g in range(0, len(a)):
            for m in range(0, len(a)):
                for n in range(0, len(a)):
                    k += 1
                    if k == 210:
                        print(a[i], a[j], a[g], a[m], a[n], end=" ")
```
**Код:**
```python
from itertools import product
words = list(product('АОУ', repeat=5))
print(*words[209])
```
# Пример 2
Виктор составляет коды из букв, входящих в слово ВИКТОР. Каждая буква
должна входить в код ровно один раз. Все возможные коды Виктор
записывает в алфавитном порядке и нумерует. Начало списка выглядит так:
1. ВИКОРТ
2. ВИКОТР
3. ВИКРОТ
Какой код будет записан под номером 266?
**Решение**:
Задаём алфавит, счётчик.
Така как слова 6-ти буквенные, то запускаем 6 циклов.
**Код:**
```python
alf, cnt = "ВИКОРТ", 0
for b1 in alf:
	for b2 in alf:
		for b3 in alf:
			for b4 in alf:
				for b5 in alf:
					for b6 in alf:
						st = b1 + b2 + b3 + b4 + b5 + b6
						if st.count(b1) == 1 and st.count(b2) == 1 and st.count(b3) == 1 and st.count(b4) == 1 and st.count(b5) == 1 and st.count(b6) == 1:
							cnt += 1
							if cnt == 266:
								print(st)
```
**Код:**
```python
import itertools
k = 0
alf = 'ВИКОРТ'
for i in itertools.permutations(alf, 6):
	k += 1
	if (k == 266):
	    print(i)
```
# Пример 3
Все пятибуквенные слова, составленные из букв С, Т, Р, О, К, А, записаны в алфавитном порядке и пронумерованы.
Вот начало списка:
1.  ААААА
2.  ААААК
3.  ААААО
4.  ААААР
5.  ААААС
6.  ААААТ
...
Определите, под каким номером в этом списке стоит последнее слово с чётным номером, которое не начинается с букв А, С или Т и при этом содержит в своей записи ровно две буквы О.
**Код:**
```python
alf = 'АКОРСТ'
k = 0
saveK = 0
saveWord = ''
for s1 in alf:
    for s2 in alf:
        for s3 in alf:
            for s4 in alf:
                for s5 in alf:
                    k += 1
                    word = s1 + s2 + s3 + s4 + s5
                    print(k, word)
                    if k % 2 == 0 and s1 not in ('АСТ') and word.count('О') == 2:
                        saveK = k
                        saveWord = word

print(saveK, saveWord)
```
# 4
Полина составляет пятизначные числа в пятеричной системе счисления, которые содержат не более трёх чётных цифр. Сколько различных чисел может составить Полина?
```python
cnt = 0
for a1 in '1234':
    for a2 in '01234':
        for a3 in '01234':
            for a4 in '01234':
                for a5 in '01234':
                    word = a1 + a2 + a3 + a4 + a5
                    word = word.replace('2', '0').replace('4', '0')
                    if word.count('0') <= 3:
                        cnt += 1
print(cnt)
```
# 5
Все шестибуквенные слова, в составе которых могут быть только русские буквы Б,Ю,Д,Ж,Е,Т,Н,И,, записаны в алфавитном порядке и пронумерованы, начиная с 11.
Ниже приведено начало списка.
1. ББББББ
2. БББББД
3. БББББЕ
4. БББББЖ
5. БББББИ
6. БББББК
7. БББББН
8. БББББТ    
9. БББББЮ

Какова сумма номеров слов, расположенных до слова БЮДЖЕТБЮДЖЕТ (не включая это слово), в которых никакие две гласные буквы не стоят рядом и никакие две согласные буквы не стоят рядом?
```python
import itertools

# itertools.product(s - алфавит, repeat = a - длина слова) составляется лова из s длины a
# itertools.permutations(s - алфавит) составляет слова из s длины s

# гласные - 0
# солгласне - 1
s = sorted('БЮДЖЕТНИК')

num = 0
sum = 0
for slovo in itertools.product(s, repeat=6):
    num += 1
    word = ''.join(slovo)
    if word == 'БЮДЖЕТ': break
    word = word.replace('Б', '1').replace('Д', '1').replace('Ж', '1').replace('Т', '1').replace('Н', '1').replace('К', '1')
    word = word.replace('Ю','0').replace('Е','0').replace('И','0')
    if not ('00' in word or '11' in word):
        print(word)
        sum += num
print(sum)
```