# Пример на возрастание
Исполнитель преобразует число на экране.
У исполнителя есть три команды, которым присвоены номера:
А. Прибавить 2
В. Прибавить 3
С. Умножить на 2
Программа для исполнителя это последовательность команд.
Сколько существует программ, для которых при исходном числе 3 результатом является число 25, и при этом траектория вычислений содержит число 10 и не содержит 17?
**Решение:**
```python
def F(s, f):
    if s > f or s == 17: return 0
    if s == f: return 1
    if s < f: return F(s + 2, f) + F(s + 3, f) + F(s * 2, f)

print(F(3, 10) * F(10, 25))
```
# Пример на убывание
Исполнитель преобразует число на экране.
У исполнителя есть три команды, которые обозначены латинскими буквами:
А. Вычесть 1
В. Вычесть 2
С. Найти целую часть от деления на 3
Программа для исполнителя это последовательность команд.
Сколько существует программ, для которых при исходном числе 19 результатом является число 4, при этом траектория вычислений содержит число 6 и не содержит 13?
**Решение:**
```python
def F(s, f):
    if s < f or s == 13: return 0
    if s == f: return 1
    if s > f: return F(s - 1, f) + F(s - 2, f) + F(s // 3, f)

print(F(19, 6) * F(6, 4))
```
# Пример на количество различных результатов
Исполнитель преобразует число на экране.
У исполнителя есть две команды, которым присвоены номера:
1. Удвоить
2. Удвоить и прибавить
Первая команда умножает число на экране на 2, вторая умножает его на 2, а затем прибавляет 1.
Программа для исполнителя это последовательность команд.
Например, программа 121 при исходном числе 3 последовательно получит числа 6, 13 и 26. Результатом программы будет число 26.
Сколько различных результатов можно получить из исходного числа 1 после выполнения программы, содержащей ровно 9 команд?
**Решение:**
```python
a = []
def F(s, k):
    if k == 0:
        a.append(s)
        return
    F(s * 2, k - 1)
    F(s * 2 + 1, k - 1)
F(1, 9)
print(len(set(a)))
```
# Пример на количество программ с определённым результатом
Исполнитель Калькулятор преобразует число на экране. У исполнителя есть три команды,
которым присвоены номера:
1. Прибавить 1
2. Прибавить 2
3. Умножить на 2
Сколько существует программ, состоящих из 6 команд, для которых при исходном числе 1
результатом является число 20?
**Решение:**
```python
count = 0
def F(s, f, k):
    global count
    if k < 0: return
    if k == 0 and s == f:
        count += 1
        return
    F(s + 1, f, k - 1)
    F(s + 2, f, k - 1)
    F(s * 2, f, k - 1)
F(1, 20, 6)
print(count)
```
# Пример на длину самой короткой программы
У исполнителя Калькулятор есть три команды, которым присвоены номера:
1. Прибавить 1
2. Прибавить 5
3. Умножить на 3
Найдите длину самой короткой программы, в результате выполнения которой при исходном числе 1 результатом является число 227.
**Решение:**
```python
from functools import *
@lru_cache(None)
def F(s, f, k):
    if s > f: return
    if s == f: 
        a.append(k)
        return
    F(s + 1, f, k + 1)
    F(s + 5, f, k + 1)
    F(s * 3, f, k + 1)
a = []
F(1, 503, 0)
print(min(a))
```

