# Пример 1
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1.  Строится двоичная запись числа N.
2.  К этой записи дописываются справа ещё два разряда по следующему правилу:
	а)  складываются все цифры двоичной записи, и остаток от деления суммы на 2 дописывается в конец числа (справа). Например, запись 11100 преобразуется в запись 111001;
	б)  над этой записью производятся те же действия  — справа дописывается остаток от деления суммы цифр на 2.
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное число R, которое превышает 43 и может являться результатом работы алгоритма. В ответе это число запишите в десятичной системе.
**Решение**:
Если в числе было нечётное количество единиц, то в конец допишется 10. Если количество единиц чётное, то допишется 00.
Рассмотрим числа, большие 43. Имеем:
4410 = 1011002
не может являться результатом работы алгоритма;
4510 = 1011012 не может являться результатом работы алгоритма;
4610 = 1011102 может являться результатом работы алгоритма, количество единиц (кроме последних двух разрядов) не- четное, и в последних двух разрядах 10.
Ответ: 46.
```python
for n in range(1, 100):
    s = bin(n)[2:]  # перевод числа в двоичную систему
    if s.count('1') % 2 == 0:
        s += "00"
    else:
        s += "10"
    r = int(s, 2)  # перевод в десятичную систему
    if r > 43:
        print(r)
        break
```
# Пример 2
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом. 
1. Строится двоичная запись числа N. 
2. Далее эта запись обрабатывается по следующему правилу: 
	- если сумма цифр в двоичной записи числа чётная, то к этой записи справа дописывается 0, а затем два левых разряда заменяются на 10: 
	- если сумма цифр в двоичной записи числа нечётная, то к этой записи справа дописывается 1, а затем два левых разряда заменяются на 11. 
Полученная таким образом запись является двоичной записью искомого числа R. 
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, большее 480.
В ответе запишите это число в десятичной системе счисления.
```python
for n in range(1, 1000):
    s = bin(n)[2:]
    if s.count('1') % 2 == 0:
        s += "0"
        s = "10" + s[2:]
    else:
        s += "1"
        s = "11" + s[2:]
    if int(s, 2) > 480:
        print(n)
        break
```
# Пример 3
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.  
1. Строится двоичная запись числа N.  
2. Далее эта запись обрабатывается по следующему правилу:  
	а) если число N делится на 3, то к этой записи дописываются её три последние двоичные цифры;  
	б) если число N на 3 не делится, то остаток от деления умножается на 3, переводится в двоичную запись и дописывается в конец числа.  
Полученная таким образом запись является двоичной записью искомого числа R.
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, не меньшее 200
```python
from string import printable
def F(n, base):
    s = ''
    while n:
        s = printable[n % base] + s
        n //= base
    return s
for n in range(1, 100):
    R = F(n, 2)
    if n % 3 == 0:
        R += R[-3:]
    else:
        R += F(n % 3 * 3, 2)
    R = int(R, 2)
    if R >= 200:
        print(n)
        break
```



```python
def F(n, base):
    s = ''
    while n:
        s = f'{n % base}{s}'
        n //= base
    return s
minN = 10000
minR = 10000
for n in range(0, 100):
    R = F(n, 2)
    if n % 3 == 0:
        R += '010'
    else:
        R += F(n % 3 * 5, 2)
    R = int(R, 2)
    if R > 300:
        if R % 2 == 0:
            if R == minR:
                minN = min(minN, n)
            if R < minR:
                minR = R
                minN = n

print(minN)
```