# 1 куча увеличение
Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём  
одновременно выполняются два условия:  
- Петя не может выиграть за один ход;  
- Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.  
Найденные значения запишите в ответе в порядке возрастания.
```python
def F(s, x):
    if s >= 125 or x < 0: return x % 2 == 0
    moves = [F(s + 2, x - 1), F(s + 4, x - 1), F(s * 2, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)

for s in range(1, 125):
	# x - количество ходов за игру
    if F(s, 3) and not F(s, 1):
        print(s)
```
# 1 куча уменьшение
Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:  
- Петя не может выиграть за один ход;  
- Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.  
Найденные значения запишите в ответе в порядке возрастания.
```python
def F(s, x):
    if s <= 30 or x < 0: return x % 2 == 0
    moves = [F(s - 3, x - 1), F(s - 5, x - 1), F(s // 4, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)
    
for s in range(31, 200):
    if F(s, 3) and not F(s, 1):
        print(s)
```
# 2 кучи увеличение
Для игры, описанной в задании 19, найдите два таких значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:  
- Петя не может выиграть за один ход;  
- Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.  
Найденные значения запишите в ответе в порядке возрастания.
```python
def F(s1, s2, x):
    if s1 + s2 >= 211 or x < 0: return x % 2 == 0
    moves = [F(s1 + 1, s2, x - 1), F(s1 * 2, s2, x - 1), F(s1, s2 + 1, x - 1), F(s1, s2 * 2, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)
    
for s in range(1, 194):
    if F(17, s, 3) and not F(17, s, 1):
        print(s)
```
# 2 кучи уменьшение
Для игры, описанной в задании 19, найдите минимальное и максимальное значения S, при котором у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
- Петя не может выиграть за один ход;
- Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.
```python
def F(s1, s2, x):
    if s1 + s2 <= 100 or x < 0: return x % 2 == 0
    moves = [F(s1 - 3, s2 - 3, x - 1), F(s1 // 2, s2, x - 1), F(s1, s2 // 2, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        # Обязательно обратно поменять на all
        return all(moves)
    
for s in range(53, 1000):
    if F(48, s, 3) and not F(48, s, 1):
        print(s)
```