
| Логическая операция      | Представление в Питоне |
| ------------------------ | ---------------------- |
| Конъюнкция (^)           | and                    |
| Дизъюнкция (V)           | or                     |
| Инверсия (-)             | not                    |
| Импликация (->)          | <=                     |
| Эквивалентность (=, <->) | ==                     |
### Шаблон программы 1:

```python
print(“w x y z F”)
for w in 0, 1:
    for x in 0, 1:
        for y in 0, 1:
            for z in 0, 1:
                F = …
                if F == …:
                    print(w, x, y, z, …)
```
### Шаблон программы 2:
```python
from itertools import product

print(“w x y z F”)
for w, x, y, z in product([0, 1], repeat=4):
    F = …
    if F == …:
        print(w, x, y, z, …)
```

### Как сопоставлять результаты
1. Находим переменную, которая всегда имеет одно значение (всегда 0 или всегда 1) и находим такой же столбец в задании
2. 
# Пример 1
Миша заполнял таблицу истинности логической функции F
$\neg (y \to x) \lor (z \to w) \lor \neg z$,
но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.

|     |     |     |     | F   |
| --- | --- | --- | --- | --- |
|     | 0   |     |     | 0   |
| 0   | 1   |     |     | 0   |
| 1   |     |     | 0   | 0   |
Определите, какому столбцу таблицы соответствует каждая из переменных w, x, y, z. B ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т.д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

**Решение:**
Напишем программу в питоне, в которой с помощью циклов подставим разные значения переменных w, x, y, z.
Далее запишем выражение.
В питоне отрицание - это not, дизъюнкция - это or, следование -> - это <=.
Рекомендуется ставить оператор not в дополнительные скобки.
Далее нужно будет самостоятельно сопоставить переменные с таблицей.
```python
print('x y z w F')
for x in [0, 1]:
	for y in [0, 1]:
		for z in [0, 1]:
			for w in [0, 1]:
				if ((w or x or (not z) or y) and (w or x or (not z) or (not y)) and (w or (not x) or (not z) or (not y))) == 0:
					print(x, y, z, w, 0)
```
# Пример 2
Логическая функция F задаётся выражением $x * (y \rightarrow z) + w$. Ниже приведён 
частично заполненный фрагмент таблицы истинности этой функции, содержащий неповторяющиеся строки. Сколькими способами можно поставить в соответствие переменные w, х, у, z столбцам таблицы истинности функции F, опираясь на информацию из данного фрагмента
**Решение:**
```cpp
from itertools import *
def f(x, y, w, z):
    return x and (y <= z) or w

s = set()
for a1, a2, a3, a4, a5, a6 in product([0, 1], repeat=6):
    table = [(1, 0, a1, 1), (a2, 0, 1, a3), (a4, 0, a5, a6)]
    if len(table) == len(set(table)):
        for p in permutations('xywz'):
            if [f(**dict(zip(p, r))) for r in table] == [0, 0, 0]:
                s.add(p)
print(len(s))
```