# План вручную
1. Определяем кол-во символов в алфавите. Обозначим за **N**. Это символы, которыми можем записать пароль, идентификатор и тд.
2. Определяем кол-во бит на символ **i** из $2^{i}>= N$. **i** - минимально подходящая степень
3. Вычисляем размер пароля или идентификатора в битах: **длина** * **i**
4. Переводим размер в байты, округляя в большую сторону
# Пример 1 с кодом
На предприятии каждой изготовленной детали присваивают серийный номер, содержащий десятичные цифры, 52 латинские буквы (с учётом регистра) и символы из 458-символьного специального алфавита. В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт. При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 862 серийных номеров отведено не более 276 Кбайт памяти. Определите максимально возможную длину серийного номера. В ответе запишите только целое число.
**Решение:**
```python
from math import *

for x in range(1, 1000):
    alf = 10 + 52 + 458
    length = x
    i = ceil(log2(alf))
    I = ceil(length * i / 8)
    if I * 862 <= 276 * 1024:
        print(x)
```
# Пример 2 с кодом
На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 261 символов. Для его хранения отведено одинаковое и минимально возможное число байт. При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 252 500 серийных номеров отведено более 31 Мбайт памяти. Определите минимально возможную мощность алфавита, из которого составляются серийные номера.
В ответе запишите только число.
**Решение:**
```python
from math import *

for x in range(1, 1000):
    N = x
    length = 261
    i = ceil(log2(N))
    I = ceil(length * i / 8)
    if I * 252500 > 31 * 1024 * 1024:
        print(N)
        break
```
# Пример 1
При регистрации в компьютерной системе каждому объекту присваивается идентификатор, состоящий из 60 символов и содержащий только десятичные цифры и символы из 250-символьного специального алфавита. 
В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное целое число байт. При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным количеством бит. 
Определите объём памяти (в Кбайт), необходимый для хранения 65536 идентификаторов. В ответе запишите только целое число количество Кбайт.
**Решение:**
1. N = 260
2. $2^{i}$ >= 260, значит i = 9
3. $60 * 9 = 540$ бит
4. 540 бит / 8 = 67,5. Округляем наверх и получаем 68
5. 65536 * 68 = 4456448 - количество байт на все идентификаторы
6. 4456448 / 1024 = 4352 килобайт
**Ответ:** 4352
# Пример 2
На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 2783 символов. В базе данных каждый серийный номер занимает одинаковое и минимально возможное целое число байт. При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным целым числом бит. Известно, что для хранения 3 845 627 серийных номеров требуется не менее 11 Гбайт памяти. Определите минимально возможную мощность алфавита, используемого для записи серийных номеров. В ответе запишите только целое число.
**Решение:**
Найдем, *сколько байт выделено на каждый номер*. Для этого переведём объём из Гбайт в байты и разделим полученное число на кол-во номеров (результат округлим в большую сторону):
$$\frac{11811160064}{3845627}=3072$$Пусть $i$ - *кол-во бит для кодирования одного символа в номере*. Тогда кол-во байт на ВЕСЬ номер поделим на длину номера и переведём в биты (округляем вверх):
$$i=\frac{3072}{2783}*8=9$$
Найдём максимальную мощность алфавита для 8  бит на символ:
$$N=2^{8}=256$$
Минимальная мощность алфавита для 9 бит будет 256 + 1 = 257
**Ответ:** 257