```python
f = open("9_1.txt") # Открытие файл с названием 9_1.txt
for s in f: # Перебор всех строк в файле

a = [] # Пустой список
b = [int(x) for x in s.split()] # Список чисел из строки, где числа разделены пробелами
c = [x for x in b if b.count(x) > 1] # Список чисел, которые повторяются более 1 раза в списке b
d = [x for x in b if b.count(x) == 1] # Список чисел, которые не повторяются в списке b

len(c) # Количество элементов в списке c
len(set(c)) # Количество неповторяющихся элементов в списке c
sum(c) # Сумма чисел в списке c

a.append(17) # Добавление числа 17 в список a
a[-1] # Вывод последнего элемента списка a
```
# Пример 1
Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите сумму чисел в строке с наибольшим номером, для которой выполнены оба условия:
—  в строке есть одно число, которое повторяется трижды, остальные четыре числа различны;
—  среднее арифметическое неповторяющихся чисел строки не больше повторяющегося числа.
В ответе запишите только число.
**Решение:**
1. Создаём файл .txt рядом с файлом .py
2. Копируем все столбцы из таблицы
3. Вставляем скопированное в файл .txt
4. Пишем код:
```python
# Пример подходящей строки: 1 1 1 5 8 7 3
sums = [] # Пустой список для сумм подходящих строк
for s in open("9_1.txt"):
    a = [int(x) for x in s.split()]
    p = [x for x in a if a.count(x) == 3]
    np = [x for x in a if a.count(x) == 1]

    # Если кол-во повторяющихся чисел = 3 И уникальных среди них - 1
    if len(p) == 3 and len(set(p)) == 1:
        # Если среднее арифметическое неповторяющихся чисел не больше повторяющегося числа
        if sum(np) / 4 <= p[0]:
            sums.append(sum(a)) # Добавляем в список сумму
print(sums[-1]) # Выводим последний элемент списка
```
# Пример 2
Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:
- наибольшее из четырёх чисел меньше суммы трёх других;
- четыре числа можно разбить на две пары чисел с равными суммами.
В ответе запишите только число.
**Решение:**
```python
count = 0
for i in open('9'):
    a = sorted([int(j) for j in i.split()])
    if a[3] < a[0] + a[1] + a[2] and a[0] + a[3] == a[1] + a[2]:
        count += 1
print(count)
```
