# Теория
### Поиск делителей
```python
def F(n):
    p = set()
    d = 1
    while d * d <= n:
        if n % d == 0:
            p.add(d)
            p.add(n // d)
        d += 1
    return sorted(p)
```
### Проверка на простоту
```python
def prime(n):
    d = 2
    while d * d <= n:
        if n % d == 0:
            return False
        d += 1
    return True
```
### Поиск простых делителей
```python
def F(n):
    p = []
    i = 2
    while i * i <= n:
        while n % i == 0:
            p.append(i)
            n //= i
        i += 1
    if n > 1:
        p.append(n)
    return p
```
### Поиск нетривиальных делителей
Нетривиальный делитель — это делитель натурального числа, который не равен и самому этому числу
# Маски
### fnmatch
`*`
`?`
`[04567]` - любой из перечисленных символов
`[!6789]` - любой, кроме перечисленных символов
### 1
Среди натуральных чисел, не превышающих 108, найдите все числа, соответствующие маске `1*23??56`, делящиеся на 171 без остатка.
В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце – соответствующие им результаты деления этих чисел на 171.
```python
from fnmatch import *

for i in range(171, 10 ** 8 + 1, 171):
    if fnmatch(str(i), '1*23??56'):
        print(i, i // 171)
```
```python
for c1 in '0123456789':
    for c2 in '0123456789':
        a = int(f'1{c1}34567{c2}9')
        if a % 17 == 0:
            print(a, a // 17)
```
### 2
Найдите все числа, меньшие 10¹², соответствующие маске `123?4*5679` и делящиеся без остатка на 4013. В качестве ответа приведите все найденные числа в порядке возрастания, справа от числа укажите результат целочисленного деления его на 4013.
```python
from fnmatch import *

# ограничиваем верхнюю границу цикла и числа, которые не нужно проверять в функции fnmatch, исходя из маски
for i in range(4013, 123999995679 + 1, 4013):
  if str(i)[:3] != '123': continue
  if i % 10000 != 5679: continue
  if fnmatch(str(i), '123?4*5679'):
    print(i, i // 4013)
```
### 3
Найдите первые пять чисел, больших 500 000, сумма делителей которых соответствует маске `*7?`. Найденные числа выведите в порядке возрастания, справа от каждого запишите найденную сумму делителей.
```python
from fnmatch import *

def F(n):
  p = []
  # 1 и само число - это тоже делители (так как про них ничего не сказано в задании)
  d = 1
  while d * d <= n:
    if n % d == 0:
      p.append(d)
      p.append(n // d)
    d += 1
  return p

cnt = 0
for i in range(500001, 100000000):
  if cnt == 5: break
  p = F(i)
  if fnmatch(str(sum(p)), '*7?'):
    print(sum(p))
    cnt += 1
```
### 4
```python
from fnmatch import *

for x in range(0, 10**8, 2023):
    if fnmatch(str(x), '11[02468]??[13579]11'):
        print(x, x // 2023)
```
# Делители
### 1
Напишите программу, которая перебирает целые числа, большие 89427150, в порядке возрастания и ищет среди них те, которые можно представить в виде произведения 8 простых множителей (не обязательно различных), при этом выполняются оба условия:

- среди простых множителей есть ровно две пары повторяющихся множителей, остальные множители различны.
- минимальный простой множитель не повторяется.

В ответе запишите первые 7 найденных чисел в порядке возрастания, а через пробел  для каждого из них соответствующий наибольший из найденных множителей.
```python
def F(n):
    p = []
    i = 2
    while i * i <= n:
        while n % i == 0:
            p.append(i)
            n //= i
        i += 1
    if n > 1:
        p.append(n)
    return p

cnt = 0
for i in range(89427151, 1000000000):
    if cnt == 7: break
    d = F(i)
    p = [x for x in d if d.count(x) == 2]
    np = [x for x in d if d.count(x) == 1]
    if len(d) == 8 and len(p) == 4 and len(np) == 4 and d.count(d[0]) == 1:
        print(i, d[-1])
        cnt += 1
```
### 2
Напишите программу, которая перебирает целые числа, большие 450 000, в порядке возрастания и ищет среди них такие, для которых наибольший натуральный делитель, не равный самому числу, не является простым числом. Программа должна найти и вывести первые 6 таких чисел и соответствующие им значения упомянутых делителей.
Формат вывода: для каждого из 6 таких найденных чисел в отдельной строке сначала выводится само число, затем упомянутый делитель. Строки выводятся в порядке возрастания найденных чисел
```python
def divs(n):
    p = set()
    d = 2
    while d * d <= n:
        if n % d == 0:
            p.add(d)
            p.add(n // d)
        d += 1
    return p

def prime(n):
    d = 2
    while d * d <= n:
        if n % d == 0:
            return False
        d += 1
    return True

cnt = 0
for n in range(450000+1, 4500000):
    if cnt == 6: break
    p = divs(n)
    if len(p) > 0 and not prime(max(p)):
        cnt += 1
        print(n, max(p))
```
### 3
Назовём нетривиальным делителем натурального числа его делитель, не равный единице и самому числу. Найдите все натуральные числа, принадлежащие отрезку [525784203; 728943762] и имеющие ровно три нетривиальных делителя. Для каждого найденного числа запишите в ответе само число и его наибольший нетривиальный делитель. Найденные числа расположите в порядке возрастания
**Решение:**
Числа имеют 3 нетривиальных делителя (делители без 1 и самого числа), значит все их делители: $p^{0},p^{1}, p^{2},p^{3},p^{4}$, где $p^4$ - само число. Нужно извлечь корень четвёртой степени из чисел в диапазоне, чтобы получить их наименьшие нетривиальные простые делители. Среди них нужно найти простые, а потом возвести в степени:
```python
def prime(n):
    d = 2
    while d * d <= n:
        if n % d == 0:
            return False
        d += 1
    return True

for n in range(152, 164+1):
    if prime(n):
        print(n**4, n**3)
```
# М
Пусть M – сумма минимального и максимального простых натуральных делителей целого числа, не считая самого числа. Если таких делителей у числа нет, то значение M считается равным нулю.

Напишите программу, которая перебирает целые числа, бо́льшие 7 800 000, в порядке возрастания и ищет среди них такие, для которых M оканчивается на 63 и кратно общему количеству различных простых делителей числа. В ответе запишите в первом столбце таблицы первые пять найденных чисел в порядке возрастания, а во втором столбце – соответствующие им значения M.
```python
def F(n):
    d = []
    i = 2
    while i * i <= n:
        while n % i == 0:
            if d.count(i) == 0:
                d.append(i)
            n //= i
        i += 1
    if n > 1:
        d.append(n)
    return d        

cnt = 0
for i in range(7800001, 100000000):
    if cnt == 5: break
    d = F(i)
    if len(d) > 1:
        m = d[0] + d[-1]
        if m % 100 == 63 and m % len(d) == 0:
            print(i, m)
            cnt += 1
```
### 2
Пусть M – сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа. Если таких делителей у числа нет, то значение M признаётся равным нулю.
Напишите программу, которая перебирает целые числа, бо́льшие 800 000, в порядке возрастания и ищет среди них такие, для которых
M оканчивается на 4. В ответе запишите в первом столбце таблицы первые пять найденных чисел в порядке возрастания, а во втором столбце – соответствующие им значения M.
```python
cnt = 0
for i in range(800001, 100000000):
    if cnt == 5: break
    j = 2
    while j * j <= i:
        if i % j == 0:
            break
        j += 1
    if j * j >= i: continue
    m = j + i // j
    if m % 10 == 4:
        print(i, m)
        cnt += 1
```