Лучше каждое действие оборачивать в скобки!
Нужно быть внимательным: 
1. при любых значениях - `all`
2. найдутся - `any`
# Пример 1
Для какого наибольшего целого неотрицательного числа А логическое выражение (zy > A) V (x > y) V (11 > r) тождественно истинно (т.е. принимает значение 1) при любых целых неотрицательных х и у?
### Способ 1
```python
for A in range(0, 1000):
    flag = True
    for x in range(0, 100):
        for y in range(0, 100):
            F = (x * y > A) or (x > y) or (11 > x)
            if F == False:
                flag = False
    if flag == True:
        print(A)
```
### Способ 2
```python
def F(x, y, A):
    return(x * y > A) or (x > y) or (11 > x)
for A in range(0, 1000):
    if all(F(x, y, A) for x in range(0, 100) for y in range(0, 100)):
        print(A)
```
# Пример 2
Обозначим через ДЕЛ(п, т) утверждение «натуральное число и делится без остатка на натуральное число т». Пусть на числовой прямой дан отрезок В = [70, 90]. Для какого наибольшего натурального числа А логическое выражение ДЕЛ(х. А) ѵ ((х є В)→ДЕЛ(х, 22))
истинно (т.е. принимает значение 1) при любом целом положительном значении переменной х?
```python
def F(x, A):
    return (x % A == 0) or ((70 <= x <= 90) <= (not (x % 22 == 0)))

for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 1000)):
        print(A)
```
# Пример 3
Определите наибольшее натуральное число А, при котором выражение 
(x&30 != 4) V ((x&35=1)→(z&A = 0)) тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной х)?
```python
def F(x, A):
    return (x & 30 != 4) or ((x & 35 == 1) <= (x & A == 0))
for A in range(1, 1000):
    if all(F(x, A) for x in range(1, 1000)):
        print(A)
```
# Пример 4
Для какого наименьшего целого неотрицательного числа А выражение (x + 2y < A) V (y>x) V (x>60)  
тождественно истинно, т.е. принимает значение 1 при любых целых неотрицательных х и у?
```python
for a in range(1000):
	if all((x + 2 * y < a) or (y > x) or (x > 60) for x in range(1000) for y in range(1000)):
	    print(a)
	    break
```
# Пример 5 (с отрезками)
На числовой прямой даны два отрезка: P = [15; 40] и Q = [21; 63]. Укажите наименьшую возможную длину такого отрезка А, для которого логическое выражение (x є P)→(((z є Q) ∧ !(x є P)) → !(x є Р)) истинно (т.е. принимает значение 1) при любом значении переменной х. 
### Отрезки
1. Перепишем выражение в более удобный вид.
	1. Вместо x принадлежит P, запишем P
	2. В качестве отрицания использовать палочку над выражением
	3. Вместо следования записать ИЛИ и добавить отрицание над левым операндом (из A -> B получится !A v B)
	4. Если отрицание над скобкой, то применяем его к каждому операнду и оператору (ИЛИ меняется на И и наоборот)
	5. Если везде стоят одни и те же операторы, то можно откинуть скобки
	6. Если при ИЛИ стоят 2 одинаковых операнда, то можно оставить 1 из них (было: !P v !P , а осталось !P)
2. Нарисуем отрезки на числовой прямой
3. Найдём, в какой части числовой прямой выражение будет давать false
4. Найдём длину этой части

# Минимум с True
```python
def F(x):
    P = 5 <= x <= 47
    Q = 12 <= x <= 76
    R = 58 <= x <= 98
    A = l <= x <= r
    return Q <= ((not P) <= ((not R and not A) <= (not Q)))

ox = [dx for x in (5, 47, 12, 76, 58, 98) for dx in (x-0.1, x, x+0.1)]

arr = []
for l in ox:
    for r in ox:
        if r > l and all(F(x) == 1 for x in ox):
            arr += [r - l]
print(round(min(arr)))
```

Ищем правую границу:
```python
def F(x):
    D = 15 <= x <= 40
    C = 21 <= x <= 63
    A = 7 <= x <= r
    return D <= (((not C) and (not A)) <= (not D))

ox = [dx for x in (15, 40, 21, 63) for dx in (x, x-0.1, x+0.1)]
arr = []
for r in ox:
    if all(F(x) == 1 for x in ox):
        arr += [r]
print(round(min(arr)))
```
# Максимум с False
```python
def F(x):
    P = 15 <= x <= 40
    Q = 35 <= x <= 60
    A = l <= x <= r

    return ((not Q) or P) and A

ox = [dx for x in (15, 40, 35, 60) for dx in (x-0.1, x, x+0.1)]

arr = []
for l in ox:
    for r in ox:
        if r > l and all(F(x) == 0 for x in ox):
            arr += [r - l]
print(round(max(arr)))
```
# Две формулы
```python
def F1(x):
    G = l <= x <= r
    P = 10 <= x <= 15

    return G <= P

def F2(x):
    Q = 10 <= x <= 20
    R = 5 <= x <= 15

    return Q <= R

ox = [dx for x in (10, 15, 10, 20, 5, 15) for dx in (x-0.1, x, x+0.1)]

arr = []
for l in ox:
    for r in ox:
        if r > l and all(F1(x) == F2(x) for x in ox):
            arr += [r - l]
print(round(min(arr)))
```
# Кол-во отрезков ненулевой длины
```python
def F(x):
    P = 20 <= x <= 85
    Q = 30 <= x <= 65
    A = l <= x <= r

    return (P == Q) <= (not A)

ox = [dx for x in range(1, 100) for dx in (x-0.1, x, x+0.1)]

cnt = 0
for l in range(1, 100):
    for r in range(1, 100):
        if r > l and all(F(x) == 1 for x in ox):
            cnt += 1
print(cnt)
```
# Множества
На числовой прямой дан отрезок А = [7;26]; В - множество всех натуральных делителей числа 77, отличных от единицы и от самого числа 77; С - множество всех натуральных делителей некоторого натурального числа у, отличных от единицы и от самого числа у (число у таково, что множество С непустое). Укажите наибольшее возможное значение числа у, для которого выражение

(x ∈ C) → ((x ∈ A) ∧ ¬(x ∈ B))

истинно (т. е. принимает значение 1) при любом значении переменной х.
```python
def F(x):
    A = 7 <= x <= 26
    B = x != 1 and x != 77 and 77 % x == 0
    C = x != 1 and x != y and y % x == 0
    return C <= (A and (not B))

for y in range(1, 10000):
    # y имеет хотя бы один делитель, кроме 1 и y
    if any(y % x == 0 for x in range(2, y)):
        if all(F(x) == 1 for x in range(1, 10000)):
            print(y)
            break
```
# Множества без отрезков
```python
a = set()
def F(x):
    P = x in [1, 3, 4, 9, 11, 13, 15, 17, 19, 21]
    Q = x in [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
    A = x in a
    return (P <= A) or ((not A) <= (not Q))

for x in range(1, 400):
    if F(x) == 0:
        a.add(x)
print(a)
print(9*3*21*15)
```
# Наибольшее множество без отрезков
```python
a = set()
for x in range(1, 60):
    a.add(x)

def F(x):
    P = x in [2, 4, 6 ,8, 10, 12, 14, 16, 18, 20]
    Q = x in [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
    A = x in a
    return (A <= P) and (Q <= (not A))

for x in range(1, 60):
    if F(x) == 0:
        a.remove(x)
print(len(a))
```
# 16-битовые цепочки (авторское)
```python
from itertools import *

a = set()
def F(x):
    P = x[0] + x[1] == '01'
    Q = x[-1] =='1'
    A = x in a
    return Q <= (P or A)

for x in product('01', repeat=16):
    if F(x) == 0:
        a.add(x)
print(len(a))
```