***При вычислении модуля от отрицательного числа его всегда сначала нужно взять по модулю***
# Задание 1
В файле содержится последовательность натуральных чисел. Её элементы могут принимать целые значения от 1 до 100 000 включительно. Определите количество пар последовательности, в которых только один из элементов является двузначным числом, а сумма элементов пары кратна минимальному двузначному элементу последовательности. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
```python
minEl = 100000
a = [int(i) for i in open('17')]
for i in a:
    if 9 < i < 100 and i < minEl:
        minEl = i

count = 0
maxSum = 0
for i in range(len(a) - 1):
    if ((9 < a[i] < 100) + (9 < a[i+1] < 100)) == 1:
        if (a[i] + a[i+1]) % minEl == 0:
            count += 1
            if a[i] + a[i+1] > maxSum:
                maxSum = a[i] + a[i+1]

print(count, maxSum)
```