Если противник делает неудачный для себя ход, то и для нас, и для противника возвращаем `any(moves)`. Если в 20 и 21 задании ничего об этом не сказано, то возвращаем all для противника.
# 1 куча увеличение
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может:  
- добавить в кучу 2 камня;  
- добавить в кучу 4 камня;  
- увеличить количество камней в куче в 2 раза.  
Например, из кучи в 20 камней за один ход можно получить кучу из 22, 24 или 40 камней.  
Чтобы делать ходы, у каждого игрока есть неограниченное количество камней. Игра завершается, когда количество камней в куче становится не менее 125. Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу из 125 или более камней. В начальный момент в куче было S камней, 1 ≤ S ≤ 124.  
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.  
Укажите минимальное значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.
```python
def F(s, x):
    if s >= 125 or x < 0: return x % 2 == 0
    moves = [F(s + 2, x - 1), F(s + 4, x - 1), F(s * 2, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)

for s in range(1, 125):
	# x - количество ходов за игру
    if F(s, 2):
        print(s)
```
# 1 куча уменьшение
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может:  
– убрать из кучи 3 камня;  
– убрать из кучи 5 камней;  
– уменьшить количество камней в куче в 4 раза (количество камней, полученное при делении, округляется до меньшего).  
Например, из кучи в 20 камней за один ход можно получить кучу из 17, 15 или 5 камней.  
Игра завершается, когда количество камней в куче становится не более 30. Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу из 30 или менее камней. В начальный момент в куче было S камней, S ≥ 31.  
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.  
Укажите минимальное значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.
```python
def F(s, x):
    if s <= 30 or x < 0: return x % 2 == 0
    moves = [F(s - 3, x - 1), F(s - 5, x - 1), F(s // 4, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return all(moves)
    
for s in range(31, 200):
    if F(s, 2):
        print(s)
        break
```
# 2 кучи увеличение
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в одну из куч (по своему выбору) один камень или увеличить количество камней в куче в два раза. Например, в одной куче 10 камней, а в другой 5 камней; такую позицию в игре обозначим (10, 5). Тогда за один ход можно получить любую из четырёх позиций: (11, 5), (20, 5), (10, 6), (10, 10). Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней.  
Игра завершается в тот момент, когда суммарное количество камней в кучах становится не менее 211. Победителем считается игрок, сделавший последний ход, т.е. первым получивший такую позицию, при которой в кучах 211 или больше камней.  
В начальный момент в первой куче 17 камней, во второй куче - S камней; 1 < S ≤193.  
Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.
```python
def F(s1, s2, x):
    if s1 + s2 >= 211 or x < 0: return x % 2 == 0
    moves = [F(s1 + 1, s2, x - 1), F(s1 * 2, s2, x - 1), F(s1, s2 + 1, x - 1), F(s1, s2 * 2, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        # any вместо all из-за неудачного хода противника
        return any(moves)
    
for s in range(1, 194):
    if F(17, s, 2):
        print(s)
        break

```
# 2 кучи уменьшение
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может убрать из обеих куч по три камня или уменьшить количество камней в одной из куч в два раза (если количество камней в куче нечётно, остаётся на 1 камень **меньше**, чем убирается). Например, пусть в одной куче 10, а в другой 15 камней; такую позицию мы будем обозначать (10, 15). За один ход из позиции (10, 15) можно получить любую из трёх позиций: (7, 12), (5, 15), и (10, 7). Игра завершается в тот момент, когда суммарное количество камней в кучах становится не более 100. Победителем считается игрок, сделавший последний ход, то есть первым получивший позицию, в которой в кучах будет 100 или меньше камней. В начальный момент в первой куче было 48 камней, во второй куче – S камней, S > 52.

Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.
```python
def F(s1, s2, x):
    if s1 + s2 <= 100 or x < 0: return x % 2 == 0
    moves = [F(s1 - 3, s2 - 3, x - 1), F(s1 // 2, s2, x - 1), F(s1, s2 // 2, x - 1)]

    if (x - 1) % 2 == 0:
        return any(moves)
    else:
        return any(moves)
    
for s in range(53, 200):
    if F(48, s, 2):
        print(s)
        break
```