# Пример 1
Учёный решил провести кластеризацию некоторого множества звёзд по их расположению на карте звёздного неба. Кластер звёзд – это набор звёзд (точек) на графике. Каждая звезда обязательно принадлежит только одному из кластеров. Центр кластера, или центроид, – это одна из звёзд на графике, сумма расстояний от которой до всех остальных звёзд кластера минимальна. Расстояние между двумя точками A(x1, y1) и B(x2, y2) вычисляется по формуле:

Даны два входных файла (файл A и файл Б). В файле A хранятся данные о звёздах двух кластеров. В каждой строке записана информация о расположении на карте одной звезды: сначала координата x, затем координата y (в условных единицах). Известно, что количество звёзд не превышает 1000. В файле Б хранятся данные о звёздах трёх кластеров. Известно, что количество звёзд не превышает 10 000. Структура хранения информации о звездах в файле Б аналогична файлу А. Возможные данные одного из файлов иллюстрированы графиком.

Для каждого файла определите координаты центра каждого кластера, затем вычислите два числа: Px – среднее арифметическое абсцисс центров кластеров, и Py – среднее арифметическое ординат центров кластеров. В ответе запишите четыре числа: в первой строке сначала целую часть произведения Px×10 000, затем целую часть произведения Py×10 000 для файла А, во второй строке – аналогичные данные для файла Б.

```python
def dist(p1, p2):
    x1, y1 = p1
    x2, y2 = p2
    return ((x1 - x2) ** 2 + (y1 - y2) ** 2) ** 0.5

def centr(cluster):
    m = []
    for p in cluster:
        s = 0
        for p1 in cluster:
            s += dist(p, p1)
        m.append([s, p])
    return min(m)

dataA = [[], []]
for line in open('27-p00a.txt', encoding='utf-8-sig'):
    x, y = [float(i) for i in line.split()]
    if x > 1:
        dataA[0].append([x, y])
    else:
        dataA[1].append([x, y])


dataB = [[], [], []]

for line in open('27-p00b.txt', encoding='utf-8-sig'):
    x, y = [float(i) for i in line.split()]
    if x > 5:
        dataB[0].append([x, y])
    elif y < 6:
        dataB[1].append([x, y])
    else:
        dataB[2].append([x, y])


cenA = [centr(data)[1] for data in dataA]
px = sum(x for x, y in cenA) / len(cenA)
py = sum(y for x, y in cenA) / len(cenA)
print(int(px * 10000), int(py * 10000))

cenB = [centr(data)[1] for data in dataB]
px = sum(x for x, y in cenB) / len(cenB)
py = sum(y for x, y in cenB) / len(cenB)
print(int(px * 10000), int(py * 10000))
```